'.//div/header/nav/a/p'  # Кнопка "Личный кабинет" в навигации
'.//fieldset[1]/div/div/input[@name="name"]'  # Поле для ввода имени
'.//fieldset[2]/div/div/input[@name="name"]'  # Поле для ввода Email в окне регистрации
'.//fieldset[3]/div/div/input[@type="password"]'  # Поле для ввода пароля в окне регистрации
'//button[contains(text(), "Зарегистрироваться")]'  # Кнопка "Зарегистрироваться"
'.//p[contains(text(), "Некорректный пароль")]'  # Элемент "Некорректный пароль" в окне регистрации
'.//fieldset[1]/div/div/input[@name="name"]'  # Поле для ввода Email в окне авторизации
'.//fieldset[2]/div/div/input[@name="Пароль"]'  # Поле для ввода пароля в окне авторизации
'.//button[text()="Войти"]'  # Кнопка "Войти" в окне авторизации
'.//button[text()="Выход"]'  # Кнопка "Выйти" в личном кабинете
'.//nav/ul/li[1]/a/p'  # Кнопка "Конструктор" в навигации
'.//section[1]/div[2]/h2[1]'  # Раздел "Булки"
'.//section[1]/div[1]/div[2]'  # Кнопка "Соусы"
'.//section[1]/div[2]/h2[2]'  # Раздел "Соусы"
'.//section[1]/div[1]/div[3]'  # Кнопка "Начинки"
'.//section[1]/div[2]/h2[3]'  # Раздел "Начинки"
'BurgerIngredients_ingredients__menuContainer__Xu3Mo'  # Класс контейнера меню ингредиентов
'Auth_login__3hAey'  # Класс окна авторизации и регистрации
